<a href="https://colab.research.google.com/github/gnbhub/GnB20222_AI_1/blob/master/20221116/1116_woodahyeon.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv("iris.csv")

df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
#np.where(조건, True값, False값)

In [ ]:
df["is_setosa"] = np.where(df["Species"]=='setosa', 1, 0)

df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  is_setosa
0           5.1          3.5           1.4          0.2  setosa          1
1           4.9          3.0           1.4          0.2  setosa          1
2           4.7          3.2           1.3          0.2  setosa          1
3           4.6          3.1           1.5          0.2  setosa          1
4           5.0          3.6           1.4          0.2  setosa          1

In [ ]:
pd.crosstab(df['Species'], df['is_setosa'])

is_setosa    0   1
Species
setosa       0  50
versicolor  50   0
virginica   50   0

In [ ]:
df['is_setosa_2'] = (df['Species'] == 'setosa') + 0
df['is_setosa_3'] = (df['Species'] == 'setosa') * 1
df.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1

In [ ]:
#df.rename({originalname:newname})

In [ ]:
df = df.rename(columns = {'Sepal.Length': 'SL'})
df.head(2)

,SL,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1

In [ ]:
#pd.apply(func = 'functionname') : r or c 방향(axis = 0, 1)으로 일괄 계산. lambda 사용,,,
#pd.astype() : 시리즈 속성 변경(int, float, str)

In [ ]:
bike = pd.read_csv("bike.csv")
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [ ]:
bike.columns

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

In [ ]:
bike_sub = bike.iloc[:4, 9:11]
print(bike_sub)
bike_sub = bike.loc[:4, ['casual', 'registered']]
print(bike_sub)
bike_sub = bike.loc[:4, 'casual':'registered']
print(bike_sub)
print(len(bike_sub))

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1
   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1
5

In [ ]:
bike_sub.sum()

casual        19
registered    83
dtype: int64

In [ ]:
bike_sub.sum(axis = 1)

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [ ]:
bike_sub.apply(func = sum)

casual        19
registered    83
dtype: int64

In [ ]:
bike_sub.apply(func = sum, axis = 1)

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [ ]:
bike_sub.apply(func = pd.Series.mean)

casual         3.8
registered    16.6
dtype: float64

In [ ]:
bike_sub.apply(func = lambda x: round(x.mean()))

casual         4
registered    17
dtype: int64

In [ ]:
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   casual      5 non-null      int64
 1   registered  5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes

In [ ]:
bike_sub['casual']

0    3
1    8
2    5
3    3
4    0
Name: casual, dtype: int64

In [ ]:
bike_sub['casual'].astype('str') + '대'

0    3대
1    8대
2    5대
3    3대
4    0대
Name: casual, dtype: object

In [ ]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [ ]:
bike['datetime'][:3]

0    2011-01-01 00:00:00
1    2011-01-01 01:00:00
2    2011-01-01 02:00:00
Name: datetime, dtype: object

In [ ]:
bike['datetime'][:3].str.slice(0, 4)

0    2011
1    2011
2    2011
Name: datetime, dtype: object

In [ ]:
bike['datetime'][:3].str.slice(5, 7)

0    01
1    01
2    01
Name: datetime, dtype: object

In [ ]:
#pd.to_datetime()

In [ ]:
bike_time = pd.to_datetime(bike['datetime'][:3])
bike_time

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
2   2011-01-01 02:00:00
Name: datetime, dtype: datetime64[ns]

In [ ]:
print(bike_time.dt.year)
print(bike_time.dt.month)
print(bike_time.dt.day)

0    2011
1    2011
2    2011
Name: datetime, dtype: int64
0    1
1    1
2    1
Name: datetime, dtype: int64
0    1
1    1
2    1
Name: datetime, dtype: int64

In [ ]:
#pd.get_dummies() : 가변수 생성

In [ ]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [ ]:
bike_dum = pd.get_dummies(data = bike, columns=['season'],
                         drop_first = True)
bike_dum.head(2)

,datetime,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_2,season_3,season_4
0,2011-01-01 00:00:00,0,0,1,9.84,14.395,81,0.0,3,13,16,0,0,0
1,2011-01-01 01:00:00,0,0,1,9.02,13.635,80,0.0,8,32,40,0,0,0

In [ ]:
'''
데이터 병합

>바인딩
>조인
 - inner join : 합집합
 - left join : A 유지 B = 합집합 반환
 
'''

In [ ]:
'''
pd. reset_index() : 기존 인덱스 초기화(0~row개수-1), 시리즈->데이터프레임 변환
pd.set_index() : 특정 변수를 인덱스로 지정
'''

In [ ]:
bike = pd.read_csv('bike.csv')
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [ ]:
#bike.sample()

In [ ]:
bike_sub = bike.sample(n = 4, random_state = 123)
bike_sub

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
6495,2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
7050,2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
558,2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
5085,2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [ ]:
bike_sub.reset_index()

,index,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,6495,2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
1,7050,2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
2,558,2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
3,5085,2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [ ]:
bike_sub.reset_index(drop = True)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
1,2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
2,2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
3,2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [ ]:
bike_sub = bike_sub.set_index('datetime')
bike_sub

,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
datetime,,,,,,,,,,,
2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [ ]:
bike_sub = bike_sub.reset_index()
bike_sub

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2012-03-07 21:00:00,1,0,1,1,18.04,21.970,62,16.9979,11,177,188
1,2012-04-12 03:00:00,2,0,1,1,13.12,15.150,61,16.9979,2,3,5
2,2011-02-06 10:00:00,1,0,0,1,12.30,14.395,52,16.9979,15,74,89
3,2011-12-05 23:00:00,4,0,1,2,18.86,22.725,88,8.9981,8,54,62

In [ ]:
bike_1 = bike.iloc[:3, :4]
bike_2 = bike.iloc[5:8, :4]
print(len(bike_1))
print(len(bike_2))

3
3

In [ ]:
pd.concat([bike_1, bike_2.reset_index(drop = True)])

              datetime  season  holiday  workingday
0  2011-01-01 00:00:00       1        0           0
1  2011-01-01 01:00:00       1        0           0
2  2011-01-01 02:00:00       1        0           0
0  2011-01-01 05:00:00       1        0           0
1  2011-01-01 06:00:00       1        0           0
2  2011-01-01 07:00:00       1        0           0

In [ ]:
df_A = pd.read_csv('join_data_group_members.csv')
df_B = pd.read_csv('join_data_member_room.csv')
df_A.head(2)

    team    No member
0  TWICE  1414     미나
1  TWICE  1462     나연

In [ ]:
df_B.head(2)

   floor  room name
0      3  3G-A   미나
1      3  3G-B   나연

In [ ]:
#pd.merge()를 사용한 병합
#left와 right 지정, left_on과 right_on 지정하여 비교군 설정
#how : inner -> inner join / left -> left join

In [ ]:
pd.merge(left = df_A, right = df_B,
        left_on = 'member', right_on = 'name',
        how = 'inner')

    team    No member  floor  room name
0  TWICE  1414     미나      3  3G-A   미나
1  TWICE  1462     나연      3  3G-B   나연
2  TWICE  1178     다현      3  3G-C   다현
3  TWICE  1525     정연      4  4G-A   정연
4  TWICE  1194     지효      4  4G-B   지효
5  TWICE  1937     채연      4  4G-C   채연
6  TWICE  1817     모모      5  5G-A   모모
7  TWICE  1117     쯔위      5  5G-B   쯔위
8  TWICE  1298     사나      5  5G-C   사나

In [ ]:
#inner join : A와 B를 병합하는데 합집합이 존재하는 행만 반환

In [ ]:
#left join : A와 B를 병합하는데 합집합이 없는 A 행도 반환, B는 결측행으로 반환

In [ ]:
pd.merge(left = df_A, right = df_B,
        left_on = 'member', right_on = 'name',
        how = 'left')

          team    No member  floor  room name
0        TWICE  1414     미나    3.0  3G-A   미나
1        TWICE  1462     나연    3.0  3G-B   나연
2        TWICE  1178     다현    3.0  3G-C   다현
3        TWICE  1525     정연    4.0  4G-A   정연
4        TWICE  1194     지효    4.0  4G-B   지효
5        TWICE  1937     채연    4.0  4G-C   채연
6        TWICE  1817     모모    5.0  5G-A   모모
7        TWICE  1117     쯔위    5.0  5G-B   쯔위
8        TWICE  1298     사나    5.0  5G-C   사나
9   Red Velvet  1228    아이린    NaN   NaN  NaN
10  Red Velvet  1243     웬디    NaN   NaN  NaN
11  Red Velvet  1013     슬기    NaN   NaN  NaN
12  Red Velvet  1373     조이    NaN   NaN  NaN
13  Red Velvet  1664     예리    NaN   NaN  NaN

In [ ]:
bike['season']==2

1